import hashlib # ця бібліоткека для обчислення кешів він навіть так називається hash lib (бібліотека хешів)

class checksum_handler: # клас який має 2 статичних методи для роботи з сумами
    @staticmethod # метод що позначає що не треба йому атрибутів
    def calculate_checksum(data: str) -> str: # у цій строці починаючи з (data: str) -> str: зараз буде пояснення, короче тут приймання аргументу data це наш рядок який потребує обробки і ми йому кажемо оброби рядок як рядок
        return hashlib.md5(data.encode()).hexdigest() # перетворює рядок у байти за допомогою методу hashlib (я його не писав тому я не скажу нічого більше)

    @staticmethod # метод що означає що не треба йому атрибутів
    def verify_checksum(data: str, checksum: str) -> bool: # і знову починаємо з (data: str, checksum: str) -> bool: тут data це вхідні данні у яких треба перевірити контрольну сумму і ми акцентуємо увагу що типу це рядок checksum це контрольна сумма яку ми хочемо порівняти тут також акцентуємо увагу що це рядок  -> bool він для цього щоб функція повертала або true або false
        return checksum_handler.calculate_checksum(data) == checksum # для розрахунку контрольної суми для data